modules/catalog/components/BlockCatalog.php

	public static function front($currentUrl = '')
	{
		$catalog = Catalog::find()->where(['is_main' => 0, 'in_front' => 1, 'status' => 1])->orderBy('weight')->all();
---
SELECT * FROM `catalog` WHERE (`is_main`=0) AND (`in_front`=1) AND (`status`=1) ORDER BY `weight`

	public static function left($currentUrl = '')
	{
		$catalog = Catalog::find()->where(['is_main' => 0, 'status' => 1])->orderBy('weight')->all();
---
SELECT * FROM `catalog` WHERE (`is_main`=0) AND (`status`=1) ORDER BY `weight`