modules/page/controllers/DefaultController.php

SELECT * FROM `page` WHERE (`status`=1) AND (`alias`='contacts')
---
    public function actionIndex($alias = '')
    {
		$page = Page::find()->where(['status' => 1, 'alias' => $alias])->one();