modules/catalog/controllers/backend/DefaultController.php

    public function actionIndex()
    {
		$mainModel = Catalog::find()->where(['is_main' => 1])->one();
---
SELECT * FROM `catalog` WHERE `is_main`=1

	protected function findItems()
    {
		return Catalog::find()->where(['is_main' => 0])->orderBy('weight')->all();
---
SELECT * FROM `catalog` WHERE `is_main`=0 ORDER BY `weight`