modules/infoblock/components/BlockText.php

SELECT * FROM `infoblock` WHERE (`status`=1) AND (`alias`='footer_left_block') ORDER BY `weight`
---
	public static function _($blockId = '', $titleBlock = '')
	{
		$infoblock = Infoblock::find()->where(['status' => 1, 'alias' => $blockId])->orderBy('weight')->one();