modules/main/components/BlockForm.php

SELECT * FROM `profile` WHERE `id`='6'
---
	public static function _recall()
	{
		$model = new FormRecall();
		if (!Yii::$app->user->isGuest)
		{
			if(Yii::$app->user->identity->profile)
			{
				$profileModel = Profile::findOne(Yii::$app->user->identity->profile->id);