controllers/BackendController.php

SELECT * FROM `siteinfo`
---
    public function behaviors()
    {
		$this->siteinfo = Siteinfo::find()->one();