controllers/FrontendController.php

	public function behaviors()
    {
		$this->siteinfo = Siteinfo::find()->one();
---
SELECT * FROM `siteinfo`