modules/fav/models/tools/FavQuery.php

    public function my()
    {
        $session = yii::$app->session;

        if(!$userId = yii::$app->user->id) {
            if (!$userId = $session->get('tmp_user_id')) {
                $userId = md5(time() . '-' . yii::$app->request->userIP . Yii::$app->request->absoluteUrl);
                $session->set('tmp_user_id', $userId);
            }
        }

        $one = $this->andWhere(['user_id' => $userId])->one();

        if (!$one) {
            $one = new \app\modules\fav\models\Fav;
            $one->created_time = time();
            $one->updated_time = time();
            $one->user_id = $userId;
            $one->save();
---
SELECT * FROM `fav` WHERE `user_id`='64f46a1b9400ba72547d2485a6a219cd'
INSERT INTO `fav` (`created_time`, `updated_time`, `user_id`) VALUES (1493098433, 1493098433, '64f46a1b9400ba72547d2485a6a219cd')