modules/catalog/controllers/DefaultController.php

    public function actionIndex($cat1 = null, $cat2 = null, $cat3 = null, $cat4 = null)
    {
		$parent = 0;
		$cat = null;

		$catInfo1 = null;
		$catInfo2 = null;
		$catInfo3 = null;
		$catInfo4 = null;

		$catalogInfo = false;
		$currentParamUrl = 'cat';

		if($cat1)
		{
			$cat = $cat1;
			if($catInfo1 = Catalog::find()->where(['alias' => $cat1])->one())
			{
				$currentParamUrl .= '/'.$catInfo1->alias;
			}
		}
		if($cat2)
		{
			$cat = $cat2;
			if($catInfo2 = Catalog::find()->where(['alias' => $cat2])->one())
---
SELECT * FROM `catalog` WHERE `alias`='sport'
SELECT * FROM `catalog` WHERE `alias`='anaboliki'

		if($cat3)
		{
			$cat = $cat3;
			if($catInfo3 = Catalog::find()->where(['alias' => $cat3])->one())
---
SELECT * FROM `catalog` WHERE `alias`='belok'


		if($cat)
		{
			$catalogInfo = Catalog::find()->where(['alias' => $cat, 'is_main' => 0])->one();
---
SELECT * FROM `catalog` WHERE (`alias`='belok') AND (`is_main`=0)


				$catalogInfo->body = str_replace($search2, $replace2, $catalogInfo->body);

				$catalog = Catalog::find()->where(['status' => 1, 'is_main' => 0])->all();
---
SELECT * FROM `catalog` WHERE (`status`=1) AND (`is_main`=0)