modules/banner/components/BlockBanner.php

	public static function _($num = 100)
	{
		$content = Banner::find()->where(['status' => 1])->orderBy('weight')->limit($num)->all();
---
SELECT * FROM `banner` WHERE `status`=1 ORDER BY `weight` LIMIT 100