modules/order/controllers/DefaultController.php

    public function actionIndex()
    {
		$this->view->params['page_class'] = '';
		$this->view->title = 'Корзина';
		$this->view->params['title_h1'] = 'Ваши товары';

		$cart = yii::$app->cart;

		$model = new FormOrder();

		$shippingMethods = Shipping::find()->where(['status' => 1])->orderBy('weight')->all();
		$paymentMethods = Payment::find()->where(['status' => 1])->orderBy('weight')->all();
---
SELECT * FROM `shipping` WHERE `status`=1 ORDER BY `weight`
SELECT * FROM `payment` WHERE `status`=1 ORDER BY `weight`