modules/main/models/Siteinfo.php

SELECT * FROM `setting` WHERE `module`='main'
---
    public function getSetting()
    {
        return Setting::find()
			->where(['module' => 'main'])
			->all();