modules/main/controllers/backend/DefaultController.php

    protected function findModel($id)
    {
        if (($model = Siteinfo::findOne($id)) !== null) {
---
SELECT * FROM `siteinfo` WHERE `id`=1