modules/menu/controllers/backend/DefaultController.php

	protected function findItems()
    {
		return Menu::find()->where(['type_id' => 0])->orderBy('weight')->all();
---
SELECT * FROM `menu` WHERE `type_id`=0 ORDER BY `weight`