modules/banner/models/Banner.php

    public function getThumb($type = 1)
    {
        return $this->hasMany(File::className(), ['content_id' => 'id'])
            ->where(['type' => $type, 'module' => 'banner'])
            ->one();
---
SELECT * FROM `file` WHERE ((`type`=1) AND (`module`='banner')) AND (`content_id`='1')