modules/product/controllers/backend/DefaultController.php

SELECT * FROM `product` WHERE `is_main`=1
---
    public function actionIndex()
    {
		$mainModel = Product::find()->where(['is_main' => 1])->one();

SELECT * FROM `action` WHERE `is_main`=0
---
	protected function findAllActionItems()
    {
        return Action::find()->where(['is_main' => 0])->all();

SELECT * FROM `catalog` WHERE `is_main`=0
---
	protected function findAllCatalogItems()
    {
        return Catalog::find()->where(['is_main' => 0])->all();

SELECT * FROM `product` WHERE `is_main`=0
---
	protected function findAllProductItems()
    {
        return Product::find()->where(['is_main' => 0])->all();

SELECT * FROM `feature` WHERE (`content_id`='1') AND (`module`='product') ORDER BY `weight`
---
	protected function findFeatures($id)
    {
        return Feature::find()->where(['content_id' => $id, 'module' => Module::getInstance()->id])->orderBy('weight')->all();

SELECT * FROM `option` WHERE (`option_type`=1) AND (`module`='product') AND (`content_id`='1') ORDER BY `weight`
---
	protected function findOptions($id)
    {
		$type = [];
		$type_data = Option::getOptionTypesArray();

		foreach($type_data as $type_id => $type_name)
		{
			$optionData = Option::find()->where(['option_type' => $type_id, 'module' => Module::getInstance()->id, 'content_id' => $id])->orderBy('weight')->all();