modules/product/models/Product.php

SELECT * FROM `option` WHERE (`option_type`=1) AND (`module`='product') AND (`content_id`='1') ORDER BY `weight`
---
    public function getCartOptions()
    {
        /* return [
            '1' => [
                'name' => 'Цвет',
                'variants' => ['1' => 'Красный', '2' => 'Белый', '3' => 'Синий'],
            ],
            '2' => [
                'name' => 'Размер',
                'variants' => ['4' => 'XL', '5' => 'XS', '6' => 'XXL'],
            ]
        ]; */

		$type = [];
		$type_data = Option::getOptionTypesArray();

		foreach($type_data as $typeId => $typeName)
		{
			$optionData = Option::find()->where(['option_type' => $typeId, 'module' => Module::getInstance()->id, 'content_id' => $this->id])->orderBy('weight')->all();

SELECT `id` FROM `action` WHERE `id`='2'
---
	private function updateActions()
    {
        $currentActionIds = $this->getActions()->select('id')->column();
        $newActionIds = $this->getActionsArray();
        foreach (array_filter(array_diff($newActionIds, $currentActionIds)) as $actionId) {
            /** @var Action $action */
            if ($action = Action::findOne($actionId)) {
                $this->link('actions', $action);
            }
        }
        foreach (array_filter(array_diff($currentActionIds, $newActionIds)) as $actionId) {
            /** @var Action $action */
            if ($action = Action::findOne($actionId)) {

SELECT `id` FROM `catalog` WHERE 0=1
---
	public function getCatalogArray()
    {
        if ($this->_catalogArray === null) {
            $this->_catalogArray = $this->getCatalog()->select('id')->column();

SELECT `id` FROM `product` WHERE 0=1
---
	public function getProductsArray()
    {
        if ($this->_productsArray === null) {
            $this->_productsArray = $this->getProducts()->select('id')->column();