modules/product/controllers/DefaultController.php

SELECT * FROM `product` WHERE (`status`=1) AND (`alias`='kineticheskiy-pesok-Kinetic-Sand')
---
    public function actionView($alias = '')
    {
		$this->view->params['page_class'] = '';

		$services = [];

		$product = Product::find()->where(['status' => 1, 'alias' => $alias])->one();

SELECT * FROM `product` WHERE `is_main`=1
---
    public function actionIndex()
    {
		$this->view->params['page_class'] = '';

		$this->processPageRequest('page');

		$query = Product::find();
        $dataProvider = new ActiveDataProvider([
            'query' => $query,
			'pagination' => [
				'pageSize' => DEFAULT_FRONT_PAGE_SIZE
			],
        ]);

		$query->andFilterWhere(['is_main' => 0])
			->andFilterWhere(['status' => 1])
			->orderBy('weight');

		$product = $dataProvider->getModels();
		//$pagination = $dataProvider->getPagination();

		$mainProduct = Product::find()->where(['is_main' => 1])->one();