modules/menu/components/BlockMenu.php

SELECT * FROM `menu` WHERE (`status`=1) AND (`parent_id`=0) AND (`type_id`=0) ORDER BY `weight`
---
	public static function main($stylePrefix = '', $type = 0)
	{
		$menu = Menu::find()->where(['status' => 1, 'parent_id' => 0, 'type_id' => $type])->orderBy('weight')->all();

SELECT * FROM `menu` WHERE (`status`=1) AND (`parent_id`=0) AND (`type_id`=1) ORDER BY `weight`
---
	public static function social($type = 1)
	{
		$menu = Menu::find()->where(['status' => 1, 'parent_id' => 0, 'type_id' => $type])->orderBy('weight')->all();