modules/fav/models/Fav.php

SELECT SUM(count) FROM `fav_element` WHERE `fav_id`=3
---
    public function getCount()
    {
        return intval($this->getElements()->sum('count'));

SELECT SUM(price*count) FROM `fav_element` WHERE `fav_id`=3
---
    public function getCost()
    {
        return $cost = $this->getElements()->sum('price*count');